app/Models/ModelProdi.php

  public function jml_prodi()
  {
    return $this->db->table('prodi')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `prodi`