app/Models/ModelDosen.php

  public function jml_dsn()
  {
    return $this->db->table('dosen')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `dosen`