app/Models/ModelMahasiswa.php

SELECT *
FROM `mahasiswa`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `mahasiswa`.`id_prodi`
ORDER BY `id_mhs` DESC
---
  public function allData()
  {
    return $this->db->table('mahasiswa')
    ->join('prodi', 'prodi.id_prodi = mahasiswa.id_prodi', 'left')
    ->orderBy('id_mhs', 'DESC')
    ->get()->getResultArray();

UPDATE `mahasiswa` SET `id_mhs` = '107', `nim` = 'kjhkjhlkhk', `nama_mhs` = 'HAYYYY', `jk` = NULL, `tempat_lahir` = '', `tgl_lahir` = NULL, `alamat` = '', `rt_rw` = '', `provinsi` = '', `kabupaten` = '', `kecamatan` = '', `kelurahan` = '', `nik` = '', `no_hp` = '', `email` = '', `nama_ayah` = '', `alamat_ayah` = '', `pendidikan_ayah` = '', `pekerjaan_ayah` = '', `penghasilan_ayah` = '', `nama_ibu` = '', `alamat_ibu` = '', `pendidikan_ibu` = '', `pekerjaan_ibu` = '', `penghasilan_ibu` = '', `id_prodi` = '1', `angkatan` = '2017'
WHERE `id_mhs` = '107'
---
  public function edit($data)
  {
    $this->db->table('mahasiswa')
    ->where('id_mhs', $data['id_mhs'])
    ->update($data);

SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
---
  public function jml_mhs()
  {
    return $this->db->table('mahasiswa')->countAllResults();