app/Models/ModelUser.php

  public function jml_user()
  {
    return $this->db->table('user')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`